app/Models/Auth/Role.php

    public function canDeleted()
    {
        if (in_array($this->id, [1])) return false;
        if ($this->users()->exists()) return false;
        if ($this->menuFlows()->exists()) return false;
        if (Approval::where('role_id', $this->id)->exists()) return false;
---
SELECT exists(SELECT * FROM `sys_menu_flows` WHERE `sys_menu_flows`.`role_id` = 2 and `sys_menu_flows`.`role_id` IS not NULL) as `exists`
SELECT exists(SELECT * FROM `sys_approvals` WHERE `role_id` = 2) as `exists`