app/Models/Auth/User.php

SELECT `sys_notifications`.*, `sys_notifications_users`.`user_id` as `pivot_user_id`, `sys_notifications_users`.`notification_id` as `pivot_notification_id`, `sys_notifications_users`.`readed_at` as `pivot_readed_at` FROM `sys_notifications` inner join `sys_notifications_users` on `sys_notifications`.`id` = `sys_notifications_users`.`notification_id` WHERE `sys_notifications_users`.`user_id` = 1 ORDER BY `created_at` DESC LIMIT 1
---
    public function getLastNotificationId()
    {
        $last = $this->notifications()->latest()->first();