app/Http/Controllers/Setting/Role/RoleController.php

SELECT count(*) as aggregate FROM `sys_permissions` inner join `sys_roles_permissions` on `sys_permissions`.`id` = `sys_roles_permissions`.`permission_id` WHERE `sys_roles_permissions`.`role_id` = 1
---
    public function grid()
    {
        $records = Role::grid()
        ->filters()
        ->dtGet()
        ->orderBy('updated_at', 'DESC');

        return \DataTables::of($records)
            ->addColumn('num', function ($record) {
                return request()->start;
            })
            ->addColumn('name', function ($record) {
                return $record->name;
            })
            ->addColumn('users', function ($record) {
                return $record->users()->count() . ' User';
            })
            ->addColumn('permissions', function ($record) {
                return $record->permissions()->count() . ' Permission';