app/Models/Traits/RaidModel.php

    public function addLog($message)
    {
        $log = new Activity;
        $log->fill(
            [
                'message' => $message,
                'module' => request()->get('module'),
                'user_id' => auth()->id(),
                'ip' => request()->ip(),
            ]
        );
        $this->logs()->save($log);
---
INSERT INTO `sys_activities` (`message`, `module`, `user_id`, `ip`, `target_id`, `target_type`, `updated_by`, `updated_at`, `created_by`, `created_at`) VALUES ('Login berhasil', 'auth_login', 1, '127.0.0.1', 1, 'App\\Models\\Auth\\User', , , 1, '2023-11-20 17:17:38')