app/Models/Master/Geografis/City.php

    public function canDeleted()
    {
        if ($this->district()->exists()) return false;
---
SELECT exists(SELECT * FROM `ref_district` WHERE `ref_district`.`city_id` = 512 and `ref_district`.`city_id` IS not NULL) as `exists`